{"title": "Spiritual Attacks: How to Recognise Them and What to Do", "text": "Spiritual attack is a concept that many people may have experienced but struggle to understand. Do you ever feel like something is holding you back from achieving your goals or living your best life? These intense moments can often leave us feeling vulnerable and powerless... Exploring the Law of One teachings can provide a foundation for understanding and combating these seemingly mysterious forces that surround us. If you're interested in spirituality, you may have heard about The Law of One, also called the Ra Material. The big teaching in The Law of One is that everything is interconnected, and we are all part of a vast, intelligent universe that exists as an intricate spiritual illusion. This notion suggests that our physical existence is but a manifestation of a thought, a dream of a divine being, and we are all interconnected as we play out the concept of finity. By understanding that we are part of a thought rather than a material universe, we can begin to perceive the world in a spiritual context and become aware of how various forces interact with us. Realising that the universe itself is alive and that we are part of a spiritual hologram, allows us to comprehend the presence and communication of spiritual forces in our lives. Uncovering the nature of these interactions can empower us in responding to spiritual attacks and ultimately aid in our personal growth and spiritual journey. In the rest of this post, we'll explore what a spiritual attack is, how it can manifest, and most importantly, how you can navigate and protect yourself from these subtle energies and ensure that your spiritual path remains unobstructed. Understanding Spiritual Attack: The Game of Life\n\nLife is a game and the ultimate goal is to become the Creator. A spiritual chessboard, the black and white squares represent our positive and negative choices, hinting at the dual nature of reality. The only rule of the game is Free Will, and every move we make determines whether we align with the positive or negative path. Service to Others or Service to Self. The third density, where we currently reside, is the density of choice and serves as a battleground for this spiritual warfare. While we cannot be forced to make a move, we can be influenced. This is where spiritual attack comes into play. In this game, the higher your spiritual progression, the more attention you receive and perceive from both positive and negative entities in the spiritual realm. Within this spiritual battleground, fourth-density entities often carry out spiritual attacks in an attempt to influence or manipulate us into choosing the negative path. From a Christian perspective, these are the Evil Forces and Evil Spirits. These attacks are known as \"Negative Greetings\" in The Law of One material. It's called a greeting because it is an offer to freely give up your power and give in to the negative. You Are a Player When facing a spiritual attack, it's crucial to remember that we are not helpless victims but active participants in the game of life. By embracing our role in this spiritual game, we can make conscious choices that align with our highest divine power and purpose, and in turn protect our spiritual charge. Just like the angel and demon on our shoulders, we are presented with a choice between the positive and negative paths. By recognizing the signs of spiritual attack and staying vigilant, we can make informed decisions that can strengthen our spiritual resilience and gain a deeper understanding of our true nature as spiritual beings. Negative Greetings and How They Work The negative path is all about control, domination, and manipulation of others for personal gain. By nature, the service to self path is quite confused, as they reject the notion of an omnipresent Creator and therefore have a hard time creating anything themselves. They are limited by the law of Free Will, which prevents them from directly interfering with us. Therefore, all they are left with is inversion and persuasion, to get us to choose to do their bidding. Believe me, the service to self lot are masters of conviction. They take what's good and convince you to see or experience it in a negative light, putting you into a low vibrational state that suits them very well. Types of Negative Greeting Telepathic/Thoughts: Our minds are powerful transmitters and receivers. Negative entities may attempt to influence our thought patterns through telepathic communication or suggestions that align with fear-based thinking. Affecting Your Senses: Spiritual attacks can distort your perceptions by inducing feelings of depression, anxiety, or confusion. Certain subtle sounds or smells may trigger you and get you into an unbalanced state. Targeting Your Insecurities: Negative forces seek out areas of weakness or insecurity. It's a common form of control, and they often exploit them to create further imbalance and self-doubt. Targeting Your Energy Centers: None of us are perfectly balanced, and our chakras reflect this. Spiritual attacks can specifically focus on an individual's less developed energy center, which can lead to various physical, emotional, or spiritual imbalances. Affecting Technology Around You: Negative entities may disrupt the technology and electronic devices you use, which can add to feelings of confusion, frustration, and unease. Nobody likes it when the internet goes down! Influencing Those Around You: Negative entities may manipulate others' actions and words to push your emotional buttons and provoke a reaction from you. This manipulation can generate discord and conflict in your relationships, making it harder to maintain your spiritual focus and integrity. By recognising these types of negative greetings and having an awareness of them is the first step in avoiding getting sucked into a spiral of negativity. Signs That You May Be Under Spiritual Attack\n\nExperiencing a spiritual attack can be a confusing and overwhelming experience. Knowing the signs can help you identify and navigate through such a situation. Here are some common indicators that suggest you may be under spiritual attack: Sign Description Apathy A lack of interest or passion for the things that used to bring joy and fulfilment. This can manifest as withdrawal from hobbies, friends, or spiritual practices. Feeling Overwhelmed An intense feeling of being emotionally and mentally drained, often accompanied by feelings of hopelessness, helplessness, or despair. This can lead to a sense of losing control over one's life. Resistance to Good Things A tendency to resist positive experiences, growth, or change. Strange events that prevent you from embracing these opportunities and doing what's good for you. This may be accompanied by feelings of unworthiness or self-sabotage. Physical Symptoms Spiritual attacks can manifest as physical symptoms. Common forms are headaches, fatigue, or aches and pains. Especially when we are predisposed to certain ailments, these can be targeted. Feeling Unsafe Spiritual attacks can create a lingering sense that you are unprotected in your surroundings, instilling fear and anxiety. These signs serve as indicators that bring our awareness back into the present moment, allowing us to choose not to let these things affect us. By staying grounded in the present and maintaining a positive mindset, we can overcome the negative effects of spiritual attacks and continue on our path towards spiritual growth and fulfillment. Remember that we have the power to choose our thoughts and emotions, and by doing so, we can create a reality that aligns with our highest good. Why Do Spiritual Attacks Happen?\n\nExploring the causes and motivations behind negative energies sheds light on the subject. In this game of life, our current goal is to choose to become more positive or more negative. This is called \"polarising\" in the Law of One and relates to our spiritual charge. The negative path seeks to convince us to infringe on someone else's Free Will. That's their ideal situation: to get you to hurt others and yourself at your own cost. That is how they progress further down the service to self path, and that's why negative greetings happen. It's important to remember that karma plays a crucial role in all of this. Negative entities are always able to affect us based on our karma and mindset. Essentially, the more you infringe on others, the more karmic debt you accumulate. Don't forget, we are all interconnected and what we do to others, we do to ourselves. Therefore, what goes around comes around eventually. The negative entities affect our environment and subtly pile up small irritations on top of each other. They are very conniving and if done correctly, go unnoticed. Carefully chipping away and testing your patience, a theme may begin to form. Their goal is for you to spiral into negativity, lose your positive charge and hurt yourself and others in the process. They feed off that energy, it's what drives their spiritual path of service to self and it's how they play the game. Negative Companion in the Law of One\n\nThe Law of One is a series of books that document a cosmic conversation that took place between 1981 and 1984. Don, Carla, and Jim were working with such a high-level caliber of spiritual entity that they attracted a lot of negative attention. Their positive work throughout the Law Of One series became a target for higher-ranking negatives, which could be considered demonic forces. In other words, the higher influence you have and the more spiritual work you do in the physical realm, the more attention you get from cosmic powers in the spiritual realm. Most evil forces that perform negative greetings with degrees of intensity are those of 4th density. However, the Law of One attracted a 5th density negative being known as the Negative Companion in the Ra Material. This entity was present throughout the contact and constantly bombarded them with negative greetings or spiritual attacks. 5th Density Entities 5th density negatives are extremely wise, highly evolved and solitary beings. They are capable of moving through not only space but through time, avoiding detection, and have the ability to see potential outcomes and go back into certain timelines to affect specific situations. They possess a deep understanding of the nature of reality, and are capable of manipulating others at the highest level. Service to Self has led them down a path of almost absolute separation. They rarely risk losing their polarity and instead control others into doing their bidding. This is why most spiritual attacks are carried out by the more common 4th density beings who follow their orders. The negative companion in the Law of One was constantly seeking to end the sessions with Ra. 5th density is the highest level of the service to self path or negative polarity possible. Because in the higher spiritual realms of 6th density, polarity ceases to exist. 6th density is that of Unity, meaning there is no more duality, and the negative path is consumed by the positive as all blends into oneness. This is the heavenly realm where Ra is from. Examples of Negative Greeting in the Law of One Throughout the Law of One sessions, their 5th density Negative Companion sought to end the contact with Ra and was a constant reminder, affecting the group through negative greetings. The group was told by Ra that Carla was an easier target due to certain conditions she chose before incarnating on Earth, and so she took much of the brunt of the spiritual attack. These attacks took various forms, including: Tape malfunctions: The sessions were recorded, but there were many disruptions with the tape recorders due to spiritual attack. To counter this, the group used three separate microphones and tape recorders in case any of them malfunctioned. Affecting the energy centers: The Negative Companion affected Carla's energy centers, particularly her blue ray and indigo rays, causing an imbalance. The blue ray energy center, which is all about communication, was heavily influenced, occasionally manifesting as sore throats for example. Her indigo ray was thrown off balance, causing confusion and feelings of unworthiness. Affecting their bodies: Spiritual attacks heightened certain allergies and caused hives and rashes that were uncomfortable and frustrating over time. Vertigo and dizziness: Carla experienced intense moments of vertigo and dizziness, symbolic of being thrown off balance. In one instance, Ra said this was a spiritual attack with the aim of Carla losing balance and risking being hurt by oncoming traffic. Strange visions: Carla experienced glimpses of strange phenomena, such as imagining stepping on small creatures while on a walk in nature. How to Protect Yourself from Spiritual Attacks\n\nWhile we cannot fully prevent spiritual attacks, we can take steps to minimize their impact and strengthen our spiritual defences. Spiritual attacks are an offering of service from the negative, and our personal karma allows certain situations to play out. However, by maintaining a positive mindset and engaging in regular spiritual practices, we can reduce our vulnerability to negative energies. In this section, we will explore some practical tips for protecting yourself from spiritual attack. By incorporating these tips into your daily life, you can build stronger spiritual defences and maintain your spiritual well-being. Humour and Light-Heartedness Negative forces are often serious, strict and controlling. Laughter and humour help diffuse negativity in any situation. Don't take things too seriously... Remember that Joy is your natural state of being. They say laughter is the best medicine and it's no joke!\n\nLaughter is a wonderful cure, so crack a smile, enjoy the company of positive and lighthearted individuals, and elevate your mood to weaken the influence of negative forces. Media Awareness Mainstream media often spread negativity and fear on a daily basis. Be mindful of the media you consume, and avoid overexposure to distressing news and sensational stories. Focusing on the negative will enhance negativity around you. Surround yourself with uplifting, inspiring, and positive content to maintain a strong spiritual aura. Inner Work and Self-Awareness Dedicate time to inner work and self-reflection, addressing any weak spots or vulnerabilities. It's much better to work on yourself while you're in a positive place. Try to work on any unresolved emotions or fears that could be exploited by negative forces. This proactive approach will help you build stronger spiritual defences. Be aware that negative forces will exploit any chinks in your spiritual armour of light. Call upon Positive Guardians Reach out to your spiritual guides, angels, or other positive forces for assistance. Ask for their guidance, protection, and strength to help you overcome challenges in your day-to-day and maintain your spiritual well-being. Unlike the negative side, they fully respect your free will decisions and will not intervene unless you ask them! So ask them. Create a Sacred Space through Rituals Just as the Law of One emphasizes creating a pure space for spiritual contact, ensure that your environment is energetically cleansed and protected. Perform rituals, meditate, or say prayers to maintain a high vibration in your space. This reinforces your choice as a positively-polarised being and may discourage negative forces from entering or influencing your life. Nurture your spirituality through regular practices such as meditation and engaging in rituals that resonate with you. Here is a guide with some ideas if you're interested. Crystals There are many crystals and they have various functions and specialities. Using certain crystals is a great way to shield yourself from negative energy. Black tourmaline is great choice for spiritual protection because it absorbs negativity. Kyanite is particularly good at cutting spiritual attacks. While Selenite is helpful to energetically release and balance other crystals around it. Keep crystals around your home, wear them as jewellery, or carry them with you throughout the day to strengthen your spiritual defences. What to Do During Spiritual Attacks"}