{"title": "What Is Deliverance Ministry and Is it Biblical?", "text": "Demons, spiritual warfare, and ugly spirits. Do these terms sound familiar to you? You probably have heard them before. Preachers speak of them every day, and the art of exorcism became known with the release of “The Exorcist” movie in 1973. The occurrence of evil spirits has led many pastors and preachers to begin what is known as deliverance ministries.\n\nDeliverance ministries have one purpose; to deliver us from evil spirits or heal us from an illness or ailment. But what is really a deliverance ministry? Is it biblical?\n\nThat is what we are going to find out.\n\nWhat Is Deliverance Ministry?\n\nDefining deliverance ministry is not simple. There are many facets to it. Most theologians will define it as the casting out or deliverance from demons or spirits. Some ministries focus more closely on delivering people from what they see as harmful emotions like anger, pride, or grief. A more detailed definition comes from Dr. Juncker.\n\n“the name commonly given to Christian individuals or ministries who believe (1) that Christians can have demons inside them; (2) that there are specific methods, techniques, and prayers for discerning the presence of demons and for casting them out; and (3) that such exorcisms are a necessary prerequisite for living a successful and victorious Christian life.”\n\nDeliverance ministry became well known in the late sixties with a change of thought regarding spiritual warfare. Four varieties of thought emerged with the first one including preachers and Bible teachers like Don Basham, Bob Mumford, Derek Prince, and Benny Hinn who took a more charismatic approach. Dispensationalists arose who were more non-charismatic in around Dallas Theological Seminary and Moody Bible College and Institute. Their approach centered around pastoral counseling and prayer.\n\nThe third variety of deliverance ministries centered around what is called the “third wave of the Holy Spirit” that spawned from the campus of Fuller Theological Seminary and what is called the Vineyard Movement. The well-known leaders of this movement were C. Peter Wagoner, John Wimber, and Charles Kraft. Their emphasis was on signs and wonders, third-world missions, and church growth. The fourth variety is more evangelical and speaks more of self-help.\n\nA quick online search will tell you the popularity of deliverance ministries is still high. Presently there are many teachers who have created ministries solely for the purpose of helping people rid themselves of demons or spirits that can influence their actions. Some have even developed ways to help people without the person ever stepping out of their home.\n\nWhat Does the Bible Say about Deliverance Ministry?\n\nIn scripture, we can find many references to Satan and his band of demons. What we don’t find is a dialogue about deliverance or deliverance becoming a ministry. In Ephesians 4:11, we find Paul writing about the offices of the church. In that reference, he says some would become apostles, prophets, evangelists, pastors, and teachers. Nowhere is there a reference to deliverance.\n\nWhen we dig deeper and look at the fruit of the spirit, we also see no reference to deliverance ministry. Fruit of the spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, and self-control. If we are living with Christ, there is no place for a demon to dwell inside you. We are filled with the fruit. You have already “crucified the sinful nature with its passions and desires” (Eph. 5:24). In Romans 8:9 it says we are not controlled by our sinful nature if the spirit of God lives in us.\n\nGod’s Word does tell us that believers will experience spiritual warfare. We will fight Satan and his demons, but not from inside us. It is an external fight. 1 John 4:4 states, “You, dear children, are from God and have overcome them, because the one who is in you is greater than one who is in the world.” Yet again, we are told as believers, no demons can get inside us, because Christ already lives there.\n\nWe are also given clear instructions regarding our fight. Ephesians 6:11 says, “Put on the full armor of God so that you can take a stand against the devil’s schemes. God also says “to be self-controlled and alert. Your enemy, the devil, prowls around like a roaring lion looking for somebody to devour” (1 Peter 5:8).\n\nIn all of God’s Word, we will not find a mention of deliverance ministry. What we find is a warning that the devil and his demons will try to oppress us. Satan’s minions can never enter into the believer. If we have Jesus, there is no place for them to dwell. If we are feeling tempted or oppressed, it is the fault of our sin nature. We must repent of our sins and turn back to God. Meditate on His Word and pray.\n\nIs Deliverance Ministry Biblical?\n\nDeliverance ministries are not biblical. The idea that soul ties, demons, hexes, and curses are real is not biblical. They come from a spiritualist or new age movement. There is no man or woman that can drive a demon from you because, as followers of Christ, demons cannot indwell in you. Only God can save us from the temptations Satan throws at us.\n\nNowhere in our Bibles does it speak of deliverance ministries. God’s Word is clear on the ministries of the church in Ephesians 4:11. God gives clear instruction on how to fight Satan in Ephesians 6:11. To say that deliverance ministries are biblical would be to say our God is lacking in strength and power.\n\nI also believe Christians should take notice of the “demons” claiming to be cast out of people. Deliverance ministries claim to drive out spirits of depression, fear, anger, and grief. These feelings are not evil spirits. They are normal feelings a person may encounter. Depression is a medical condition. As a person who has suffered with depression for many years, it saddens me that there are men and women of God who believe I have an evil spirit inside me. What I have is a sin nature, and since the Fall of Man, sin has been the cause of illness.\n\nAnger, fear, and grief are all emotions that Jesus felt. In Matthew 21:12, Jesus became angry at the people buying and selling items at the temple. He became so angry he turned the table over. When Jesus was in the Garden the night he was arrested, he felt fear. He asked God if there was another way (Matthew 26:42). His grief was shown when his friend Lazarus died (John 11:1-44). None of his emotions were the result of a demonic spirit.\n\nJesus felt these emotions, then why are they evil spirits when we feel them?\n\nWhat is biblical is our Savior has already won the battle. He alone can help us through whatever trials we may have. If we read His Word, meditate on His promises and instruction, and spend time in prayer, we can conquer anything.\n\nConclusion\n\nAre deliverance ministries biblical? I believe they are not. I do believe that we are in a spiritual battle daily, but there is no ministry or person who can “cure” us. Christians have the spirit of God in them, which leaves no room for demons to take up residence. God’s Word specifically tells us that He alone can save us from our sins. When we accept Him, we are free from our sin. Our sin may haunt us, but it can never control us because we are children of God.\n\nPhoto Credit: ©iStock/Getty Images Plus/kevron2001\n\nAshley Hooker is a freelance writer passionate about missions. She has collaborated with mission teams in North Carolina, Mississippi, Texas, West Virginia, and Vermont. Presently, she lives in North Carolina with her husband and two children, where she fulfills roles as a pastor's wife, a dance mom, and a farm girl."}