{"title": "The basic deliverance process", "text": "The basic deliverance process\n\nNow before you read this, I want to tell you that not all good ministers will follow these exact steps. It really doesn’t matter as long as the person is being truly getting set free and is able to maintain their freedom afterwards. There are times when these rules need to be bent as the Holy Spirit leads the deliverance session. Sometimes demons must be cast out before the inner healing process can take place, for example. This is just to give you an idea of how I like to go about a typical deliverance process.\n\nThe most important part of the deliverance process is finding out what their bondages are, how the devil is operating in those bondages, and what we need to do in order to get them set free. Without that knowledge, we are going into the deliverance setting blindfolded. The Holy Spirit plays a very real and important role in this step of the process. I like to educate the person that I am ministering to for a few reasons. I can ask them questions all day long, but if I teach them how the basic areas of bondage work, they will be likely to recognize how that applies to their situation themselves. This allows both of us to better understand what is going on in their situation. I like to give them a basic understanding of soul ties, word curses (which they, their parents, others, etc. may have spoken over them), strongholds, emotional wounds, traumas, etc. Describing how these things work to the person will open their eyes to see how they need help dealing with those things in their own situation. Best of all, it helps the person I am ministering to feel very comfortable with both me and the process that I am taking them through. Of course, deliverance questionnaires are very helpful as well in these interviewing stage, and I encourage using them to uncover additional areas of bondage. Throughout the process, the Holy Spirit may be revealing or bringing to memory the things which need to be addressed. Throughout this step of the process, have a clipboard handy and make notes of anything that comes up which needs to be repented of, broken, strongholds torn down, traumas, emotional wounds, etc. It is always a good idea to ask the person about their family history to reveal possible generational bondages. If the person you are ministering to has a bondage to sexual perversion, and all of their siblings have the same bondage, then that’s a good indication that you’re dealing with a generational bondage.\n\nThe next step in the process is going through and begin breaking up legal grounds though repentance of sins (which opened the door to the enemy), renouncing ungodly vows, breaking soul ties, renouncing word curses, breaking generational curses, etc. During this stage, it is quite common to have alters (in cases of disassociation) as well as spirits surface and manifest, so be prepared to bind and cast if needed at this stage, but also be careful not to treat alters (hurt or wounded parts) as demons, as you can do even more damage to an already hurting part and lose it’s trust (which is very important). Keep an eye out for the times when the spirits come up, for example, if a spirit surfaces while the person is breaking a soul tie, then you can be pretty sure that it is hanging onto that soul tie and is upset that you’re breaking it. If you pay attention to what steps the person it taking when the spirits come up, it clues you into what kind of spirit you’re dealing with. It is also helpful to stop once in a while and ask how the person feels, if they feel pressure, confusion, pain, etc., it can indicate a spirit that is manifesting. The person should also be able to tell when something has left them, as they usually feel lighter, happier, cleaner. Sometimes spirits can manifest and try to disrupt the process, and in such cases you might have to bind them and command the spirit(s) to go down while you speak and work with the person. You can always call that spirit back up later on and deal with it.\n\nThe next step that we must address at sometime here is behavioral issues. Some of these issues include self-hate, self-unforgiveness, false guilt, strongholds, unforgiveness, rejection (based on false identities), fabricated personalities (when a person becomes somebody they aren’t to please or be accepted by others), etc. If the person has experienced traumas, it is important to lead them to a place of emotional healing. This is the Holy Spirit’s job, but since He doesn’t go where He isn’t welcome, we can easily put up walls which will block His efforts to heal our wounds. These blocks can be in place through fear as a result of guilt, for example. This is why it is important to deal with any issues of guilt, fear, self-rejection, etc. The person needs to come to a place where they see themselves as who they are in Christ (what God’s Word says about them), clean, forgiven, washed with the Blood, and they also need to see God as a loving and kind heavenly Father as opposed to a cruel and distant taskmaster. They also need to come to a place of forgiving those who have wronged or hurt them. Another important thing to do is bring them to a place of honoring their parents. Now for those who have suffered abuse and terrible childhoods, we are not asking them to honor their parents in things which are dishonorable. We honor our parents to the extent that they honor the Lord. If all we can do is thank God and give them honor for using them to bring us into this world, then it is important that they do just that, which makes it much easier to forgive them. There are a lot of issues that can be addressed in this step of the process, but it plays an irreplaceable role in getting the person set free and healed of emotional wounds, traumas, abuse, etc.\n\nBy now, you should have a legal pad full of notes, which clues you into what spirits that need to be bound and cast out. Taking authority in Jesus’ name, you can begin to bind a spirit to all of it’s kind in the person (this allows you to cast out an entire nest of demons instead of one at a time), and cast them out of every part (this covers the possibility of a related spirit hiding out in an alter).\n\nThis is of course a very rough and over simplified guide to the basic deliverance process that I choose to use in deliverance sessions. Other ministers will use different steps, or put things in different order, and that is perfectly acceptable as long as the person is being set free and is able to maintain their freedom afterwards. I also stay open to the Holy Spirit, because sometimes these steps need to be altered in order to effectively deal with the situation at hand. It also is helpful to give the person some post-deliverance advise, such as cautioning them about how demons can try to deceive you into thinking that they have returned, and what to do in such situations, etc."}