{"title": "Deliverance from demons (evil spirits) and breaking curses", "text": "The basics of a deliverance\n\nThis is a very simple look into the world of deliverance. It is by no means a complete manual, but I hope it helps to give a better understanding of how this process works.\n\nKnow who you are in Christ\n\nFor one, we must understand what Christ has done for us, and where we stand. If we are believers in Christ Jesus, then we are seated with Him in heavenly places (Eph 2:6). This places us up above the angelic (and demonic) realm, and right up there next to Jesus! So instead of looking up at the demons, we can now look down upon them, which makes a big difference when you’re doing spiritual battle.\n\nUnderstand our authority over the enemy\n\nIt is also vital to understand the authority given to us over all powers of the enemy. We have been given authority over all powers of the enemy (Luke 10:19 & Mark 16:15-18). I believe with authority, we are given responsibility. I don’t believe we are to pray and ask the Lord to cast the demon out, I believe that is something we ourselves are to do. I know when it comes to binding and loosing, there is nowhere in the NT that it tells us to pray and ask God to bind the devil. But it does say that WE are to bind, and WE are to loose. Matthew 16:19, “And I will give unto thee the keys of the kingdom of heaven: and whatsoever *thou* shalt bind on earth shall be bound in heaven: and whatsoever *thou* shalt loose on earth shall be loosed in heaven.” Jesus gave us the keys, but it’s up to us to use them!\n\n“Legal rights”\n\nThere are a set of ‘rules’ that apply in the spiritual realm. When we violate these rules, it opens us up to the enemy. The Old Testament is a great place to learn about these rules. For example, if a man sleeps with his brother’s wife, this can bring a curse upon them of childlessness (Lev 20:21). Getting involved with the occult is a big door opener, and so are sexual sins. Sometimes our ancestors don’t help matters any (Exodus 20:5). Some other common doors include being bitter and unforgiving (Matthew 18:23-35), un-confessed sins, and holding onto cursed objects (such an occult rings or idols).\n\nUnderstanding what Jesus did for us\n\nJesus shed His blood to set us free from the “curse of the law.” Therefore, if we have picked up any curses (from our actions, our family bloodline, etc.), we can be freed from them! It is important to understand that Jesus has paid the price for our complete (spiritual, physical, mental, emotional, etc.) freedom! If you don’t believe it, it’s hard to claim it.\n\nClosing doors and destroying legal rights\n\nBefore a demon is cast out, it is important to close the doors that have been opened to him and any rights he may be using to stay there. This is most often done through repentance (confessing and turning from our sins – more serious sins may need to be confessed by name), renouncing (this means to formally give up – do this out loud so the enemy can hear you), taking a stand to forgive those who have wronged you, and breaking of curses (this is done using our authority in Jesus). If there are any physical objects that you’ve been holding onto that are tied in with the occult, then those need to be destroyed, as they can hold demonic spiritual value.\n\nCast the demon(s) out!\n\nNow stand on your authority and cast those demons out! I do caution to read more on deliverances before attempting this, because dealing with the demonic when you are unexperienced can be dangerous and unless you feel God leading you to flush the demon out of hiding, you might better grab a book such as Unbound by Neil Lozano and get a better understanding of how this ministry works. Once you understand it, you will feel a lot more relaxed and know how to handle the demons as they manifest.\n\nTo put it in a nutshell:\n\nIt’s important to know our ‘rights’ (what Jesus did for us, our authority, etc.). It is also important to know who we are in Christ. One of the most important steps in a deliverance, is to figure out what opened the door to the enemy (legal rights), and close those doors. Then it’s a matter of using our authority to cast out the evil spirits out."}