{"title": "7 Steps to Prepare Yourself for Self-Deliverance — Destiny Image", "text": "If an experienced deliverance minister is not available, and you are venturing into deliverance for yourself, there are several steps you can take to prepare yourself. These seven steps will guide you, give you a structure to follow, and help you proceed with confidence into your freedom. They are:\n\nProclaim God’s Word out loud. Praise and worship God. Bind and loose. Use the blood of Jesus in prayer. Cast out your fear. Remove any hindering spirits or thoughts. Forgive.\n\n1. Proclaim God’s Word Out Loud\n\nWhy out loud? Because the devil is called the prince of the air (see Eph. 2:2)! Therefore, we must be vocal with our declarations, praises, and warfare prayers to defeat the enemy. This is the very reason the Word of God is called the Sword of the Spirit (see Eph. 6:17). If you don’t take your sword out of its sheath, how can you use it? Taking your Bible in your hands and declaring out loud the Word of God is how you use your sword, which is your divine weapon against Satan and his armies.\n\nDavid didn’t go before Goliath in silence. He won his battle before he threw the stone by the declaration that came out loud from his mouth.\n\nDavid said to the Philistine, “You come against me with sword and spear and javelin, but I come against you in the name of the Lord Almighty, the God of the armies of Israel, whom you have defied. This day the Lord will deliver you into my hands, and I’ll strike you down and cut off your head. This very day I will give the carcasses of the Philistine army to the birds and the wild animals, and the whole world will know that there is a God in Israel. All those gathered here will know that it is not by sword or spear that the Lord saves; for the battle is the Lord’s, and he will give all of you into our hands” (1 Samuel 17:45-47).\n\nLook at the young shepherd boy David’s faith. Look at his declaration. Look at the glorification and exaltation of His God, Yahweh. All of this he declared aloud.\n\nWhen Saul was tormented by an evil spirit, David played anointed worship music and the evil spirit left Saul (see 1 Sam. 16:14-23).\n\nGideon won a battle with only 300 men against a vast army just by shouting, “For the Lord and for Gideon” (Judg. 7:18,20).\n\nThe walls of Jericho collapsed when the Israelites shouted and blew trumpets and marched around the city for seven days (see Josh. 6:1-20).\n\nJehoshaphat and his army won a battle against a vast army by singing and praising the Lord and saying, “Give thanks to the Lord, for his love endures forever” (2 Chron. 20:21).\n\nFaith comes through hearing the Word of God (see Rom. 10:17).\n\nYou need faith to do self-deliverance. You must believe that God is on your side and that you will be free. You need a faith boost. If you don’t read the Word out loud, how can you hear the Word?\n\nProclaim the following personalized deliverance Scriptures out loud:\n\nNo weapon formed against me shall prosper, and every tongue which rises against me in judgment I shall condemn. This is the heritage of the servants of the Lord, and my righteousness is from the Lord (Isaiah 54:17).\n\nWhen the enemy comes in like a flood, the Spirit of the Lord will raise up a standard against him (Isaiah 59:19).\n\nI overcome the devil by the blood of the Lamb and by the word of my testimony, that I am a child of God (Revelation 12:11).\n\nIn righteousness I shall be established; I shall be far from oppression, for I shall not fear; and from terror, for it shall not come near me (Isaiah 54:14).\n\nFor the weapons of my warfare are not carnal, but mighty in God for pulling down strongholds (2 Corinthians 10:4).\n\nIn addition to all this, I take up the shield of faith, with which I can extinguish all the flaming arrows of the evil one. I take the helmet of salvation and the sword of the Spirit, which is the word of God (Ephesians 6:16-17).\n\nChrist has redeemed me from the curse of the law, having become a curse for me, for it is written: “Cursed is everyone who is hung on a tree” (Galatians 3:13).\n\nI am in complete agreement with Paul’s prayer that:\n\nOut of His glorious riches He may strengthen me with power through His Spirit in my inner being so that Christ may dwell in my heart through faith. I, being rooted and established in love, have the power, together with all the Lord’s holy people, to grasp how wide and long and high and deep is the love of Christ, and to know this love that surpasses knowledge—that I may be filled to the measure of all the fullness of God (Ephesians 3:16-19).\n\n2. Praise and Worship God\n\nPraise brings victory. When you exalt God, the devil shrinks and shrinks and becomes nothing. The best way to start self-deliverance is through praise and worship.\n\nThe Lord is my light and my salvation—whom shall I fear? The Lord is the stronghold of my life—of whom shall I be afraid? (Psalm 27:1)\n\nDeclare these praises aloud to Him:\n\nLord Jesus, You are my High Priest (Hebrews 4:14-16)\n\nYou are my Prince of Peace (Isaiah 9:6)\n\nYou are my Rock (Psalm 18:2)\n\nYou are my Deliverer (Psalm 18:2)\n\nYou are my Stronghold and Deliverer (Psalm 144:2)\n\nYou are the Lord (Exodus 6:2-3)\n\nYou are Lord of Earth (Joshua 3:13)\n\n3. Bind and Loose\n\nWhatever you bind on earth will be bound in heaven, and whatever you loose on earth will be loosed in heaven (Matthew 16:19).\n\nBinding and loosing is a powerful weapon to disarm the enemy and render him useless. Unfortunately, many Christians don’t make use of this incredibly powerful tool. When I found out how effective and powerful this divine weapon was, I started applying it and putting it to use in many situations.\n\nFor example, from time to time I had to be in an environment where there was an incredible amount of strife, wickedness, and hypocrisy. I had to be subject to a person who confessed to be a Christian, but somehow, long before I knew him, he had lost his connection with the Head—that is, with Christ. He was working and functioning like a robot and had no sense or convictions. He had a faultfinding and sarcastic personality. He partnered with his helper to slander and persecute me. Even though he was in charge, he would only hear his helper’s comments and accusations. This is an Ahab personality. And you can guess what the operating spirit in the other person was! He was getting the nurturing and affection he needed from his helper. This bound the soul-tie between them, and it was very strong—and demonic.\n\nThey both operated under the two principalities of the Ahab-and-Jezebel combination. These two always go hand in hand together. Where there is an Ahab, there is a Jezebel. Where there is a Jezebel, there is always an Ahab. Also, the spirit behind Ahab carries a deaf and dumb spirit. (This is spiritual deafness and dumbness.) The person can be super intelligent with regard to IQ but is not spiritually discerning. You speak to them and get nowhere. Oftentimes they don’t even answer or comment. They look disengaged and numb. You may explain things in great detail yet never get heard. This is because they are spiritually deaf, which creates something of a numbness. They have little or no convictions of the Holy Spirit. Outwardly, they may be living a self-righteous Christian life, as was the case in this man’s example, but they are operating on automatic pilot, having no sense or personal relationship.\n\nMany women in the church have husbands like this and are in deep depression, as their voices are not being heard. They are alone and wondering what is causing their misery. How did love and affection leave their marriage? And because they are the one suffering with depression, they assume they are the problem. If they could just know and realize that the enemy first disarmed and pacified their husbands, then victimized them afterward to disable their support system. Many times, I have wished their husbands had come for deliverance instead of them.\n\nIn the case of the previous example, I started binding and loosing the Jezebel and Ahab principalities in that situation, and the result was amazing. Once God revealed to me the principalities that were ruling over them, I started putting into practice the simple divine tool that Jesus gave me. I started binding the spirits of Jezebel and Ahab, and loosing God’s peace, protection, love, and joy. The power of darkness backed off. The result was the proof that the principalities were an exact demonic match. If you are going through something like this, you need to fight against the principality of darkness, not the people.\n\nOver the years, I found out how powerful binding and loosing is. Jesus taught us how to bind and loose in two Scriptures in the Book of Matthew.\n\nWhatever you bind on earth will be bound in heaven, and whatever you loose on earth will be loosed in heaven (Matthew 16:19).\n\nTruly I tell you, whatever you bind on earth will be bound in heaven, and whatever you loose on earth will be loosed in heaven (Matthew 18:18).\n\nHow do we bind and loose?\n\nBind the principality of darkness or the demonic! Loose what is of God from heaven.\n\nYou can also bind the demons of others to prevent their influence and harm to you. Exercise your authority in Christ!\n\nDeclarations for Binding and Loosing\n\nLord Jesus, according to Your Word and promise, I bind any violent display of the enemy or any plans and assignments against me and my family, and I loose freedom and peace in Your Name, Jesus, I pray. Amen.\n\nI bind the spirit of anger, frustration, and strife and loose peace, patience, and joy. I rebuke the enemy and declare the power of the blood of Jesus over me and my family right now in Jesus’ Name. Amen.\n\nI bind the spirit of negative thinking and mind torment, and I loose peace and joy in Jesus’ Name. I am covered by the blood of Jesus. Amen.\n\nI bind and cast out fear and anxiety right now and I loose joy and calmness in Jesus’ Name. I am under the blood covering and protection of Jesus Christ. Amen.\n\nI bind the demons of gossip and slander in this place right now and loose unity and love in Jesus’ Name. Amen.\n\nBinding Prayer Before Self-Deliverance\n\nDear Lord Jesus,\n\nAccording to Your Word, I bind the interference of the enemy and any demonic forces from my deliverance. I bind the demons of lies, deception, confusion, doublemindedness, and any violent attack during and after my deliverance, in Jesus’ Name. I release Your truth, Spirit of Truth; I release Your freedom; I loose Your deliverance and redemption in the Name of Jesus Christ. Amen. I cover myself and this time with the powerful blood of Jesus. Amen.\n\nI have seen a video where a robber was entering a store to rob the place. He pulled his gun and told the lady behind the counter to give him all the money in the register. She boldly told him, “I bind you, Satan, in the Name of Jesus. Leave my store right now, in Jesus’ Name.” The thief immediately left the store. (I am not telling you to do the same. You have your own responsibility in your life to protect yourself and others and to use whatever weapon you think you need in order to do that.)\n\nMy husband and I used to engage easily in arguments that resulted in big fights. When I made up my mind to defeat the devil in my marriage by fighting differently than before, I started binding the spirits of strife, anger, division, and quarrels and began loosing love, joy, and peace into my marriage and started seeing miraculous outcomes. But I had to first make up my mind that I was not ever going to answer or react to my husband the way I used to, but only in the powerful way of Jesus, who taught me this. I am a living example of this truth today.\n\nI heard a testimony of a Christian woman whose husband was regularly beating her up. She started binding the demons behind her husband’s evil act. She said when her husband was walking toward her to hit her, she would start binding, and the man would turn back and leave the room. (Again, your situation may be different. I strongly suggest that you seek the truth and the guidance of God in your situation. But I cannot emphasize more the power of binding and loosing.)\n\nWhen you are binding and loosing, you don’t have to yell or shout. You can bind and loose under your breath with a whisper. But still do it vocally, because the prince of the air has to hear it to be stopped.\n\nI also release confusion, blindness, and torment over the enemy, so he cannot be in my presence without being tormented. In Mark 5, demons asked Jesus if he was going to torment them, proving that He could have done so and they knew it. We have an authority in Christ that we must start using.\n\n4. Use the Blood of Jesus in Prayer\n\nThey [Christians] triumphed over him by the blood of the Lamb and by the word of their testimony (Revelation 12:11).\n\nThe blood of Jesus has tremendous power. Just as with binding and loosing, many Christians don’t use the power of the blood. Every day I cover myself, my family, my ministry team, board, friends, and even followers with the blood of Jesus.\n\nThere were many times when demonic manifestations took place and people became monstrous to the point of extreme violence because of the strong demonic powers in them. But because of the power of the blood of Jesus over me, never could they harm me. Even though there were times it became both a physical and a spiritual battle, they couldn’t hurt me. There were times demons from other people spoke to me and told me they could do this and that to me. I said, “I am under the blood protection and covering of Jesus Christ and I am a child of the living God. You cannot touch me.” They backed off as soon as I declared my position in Christ.\n\n5. Cast Out Your Fear\n\nGod has not given us a spirit [demon, because it is written with a small “s”] of fear, but of power and of love and of a sound mind (2 Timothy 1:7 NKJV).\n\nThere is no fear in love. But perfect love drives out fear (1 John 4:18).\n\nWhat do you cast out? You cast out demons.\n\nReceiving and trusting God’s perfect and unconditional love is an automatic result of freedom from fear. If you know someone loves you perfectly, you know they will protect you and they have your best interests at heart.\n\nComing from Islam and worshiping a false Muslim god for almost two decades, I had a hard time accepting God’s love. I was not free from fear, even though I had become a Christian, because I still believed that God was out to get me. Somehow I was believing I had to be punished for everything I had done in my past. One day, God tenderly spoke to me that I didn’t know Him well enough and that I was rejecting His love. He told me that I was believing in the lies and deceptions of the devil. I was nullifying the power of the cross. I immediately repented from believing lies about God and received His love and was set free from fear.\n\nOne of the biggest weapons the devil uses against us is fear. Fear is paralyzing. Fear is tormenting. There is no peace where there is fear. There is no joy where there is fear. Fear can get you stuck, keep you bound in the same place, and waste your years.\n\nThe opposite of fear is faith. Faith comes through hearing the Word of God. Therefore, you need to exercise the declaration of the Scriptures and praise God out loud, as I taught you earlier.\n\nMany people are afraid of self-deliverance or deliverance performed by a minister because of the possibility that the demons could manifest or shriek, and they would be embarrassed or get hurt. They think, “What if something goes out of control?”\n\nWhen I shared my self-deliverance guide on social media, a lot of people wrote to me that the steps I was teaching were working, but because fear entered their hearts during their deliverance, they didn’t continue and couldn’t get set free.\n\nI want to help you get rid of the fear of self-deliverance. You need to understand and believe the following:\n\nGod loves you and wants to set you free. Your deliverance is God’s will.\n\nJesus died on the cross for your freedom (see Gal. 5:1).\n\nIf you want freedom, you will have freedom:\n\nWhich of you, if your son asks for bread, will give him a stone? Or if he asks for a fish, will give him a snake? If you, then, though you are evil, know how to give good gifts to your children, how much more will your Father in heaven give good gifts to those who ask him! (Matthew 7:9-11)\n\nAs I mentioned before, you can bind the enemy from any violent manifestation and command it or them to leave quietly.\n\nI bind you, devil, in the Name of Jesus, and you will leave peacefully and quietly with your demons, in Jesus’ Name. I am under the blood covering of Jesus; you cannot touch me. Amen.\n\nGod is merciful. Do you believe that you will be doing self-deliverance to kick the enemy out of your life and God will hand you over to Satan or his demons? No! He is on your side because the devil is His enemy. But you must trust Him fully.\n\nFirst you need to know there are three types of fear:\n\n1. Fear of Evil/Demons\n\nEvery fear that is not fear of God is demonic. If you’re afraid of demons, this too is from demons. Demonic fears make up a long list:\n\nFear of accidents\n\nFear of poverty\n\nFear of dying alone\n\nFear of sickness\n\nFear of abandonment\n\nFear of rejection\n\nFear of failure\n\nFear of people\n\nFear of terror\n\nFear of death\n\nFear of dark\n\nFear of close spaces\n\nFear of losing a job\n\nThese are all demonic fears that come from the devil and from not trusting God.\n\n2. Fear That Comes from Not Being Right with God\n\nThis type of fear is very close to the previous one. Not being right with God opens a door to the enemy.\n\nI know a young girl who was extremely fearful. She was living a double life (she was only attracted to married men, as she confessed, and tried to wreck their marriages). She ruined her best friend’s marriage, and many married and older men in the ministry were seduced by her. She was living in constant fear of being exposed. Later, when it was exposed, she confessed that she had always been fearful that one day God would reveal all she had been doing in secret. Even the male leadership were under her demonic spell and were secretly in love with her. These were all married men. But the curses and misery that came upon them were undeniable. Their lives, marriages, and children have suffered greatly. The wicked live in fear.\n\nThe wicked flee though no one pursues, but the righteous are bold as a lion (Proverbs 28:1).\n\nIf you fear people, you need to ask yourself if there is anything in you that is not right with God. Or, if you fear and despise authority, the root cause is a rebellious heart.\n\nOnce someone prophesied over me that the devil was afraid of me. Immediately, the Holy Spirit bore witness in my heart. Later, many times demons spoke through people during their deliverance, saying they were afraid of me. That in itself was evidence of the demonic possession or oppression of an individual. You need to understand that demons can also oppress an individual with that kind of fear.\n\n3. Fear of God\n\nThis is the only scriptural fear any of us should have. This fear is not like in Islam, that we should dread and be terrified of our God. But it is a healthy, reverential fear of God, knowing that if we do not live a life that pleases Him, we will face consequences that would not be pleasant.\n\n6. Remove Hindering Spirits or Thoughts\n\nIn Mark 9, Jesus addressed a hindrance before the deliverance.\n\nSo they brought him. When the spirit saw Jesus, it immediately threw the boy into a convulsion. He fell to the ground and rolled around, foaming at the mouth.\n\nJesus asked the boy’s father, “How long has he been like this?”\n\n“From childhood,” he answered. “It has often thrown him into fire or water to kill him. But if you can do anything, take pity on us and help us.”\n\n“‘If you can’?” said Jesus. “Everything is possible for one who believes.”\n\nImmediately the boy’s father exclaimed, “I do believe; help me overcome my unbelief!”\n\nWhen Jesus saw that a crowd was running to the scene, he rebuked the impure spirit. “You deaf and mute spirit,” he said, “I command you, come out of him and never enter him again.”\n\nThe spirit shrieked, convulsed him violently and came out. The boy looked so much like a corpse that many said, “He’s dead.” But Jesus took him by the hand and lifted him to his feet, and he stood up.\n\nAfter Jesus had gone indoors, his disciples asked him privately, “Why couldn’t we drive it out?”\n\nHe replied, “This kind can come out only by prayer” (Mark 9:20-29).\n\nHindering spirits will try to stop your deliverance! These demons may not be the most immediately obvious ones. Many times, people are aware of a sin issue they are struggling with—or you may be able to clearly see that a certain sin is operating in their lives—but before you can address the demons behind that sin, there are often some subtler demons “guarding the door.” They will hinder any attempt at deliverance unless they are bound and cast out first, as in the following examples.\n\nLies and Deception\n\nThe spirit of lies and deception is one of the major hindrances to deliverance and is usually the first demon to be cast out.\n\nI was ministering deliverance to a lady who had many demons. After spending some time getting nowhere, I stopped and started praying, which is what I usually do if the deliverance is taking a long time. I said, “Holy Spirit, Spirit of Truth, please reveal to me what is hindering her deliverance. In Jesus’ Name I ask. Amen.” As soon as I prayed, it was revealed that she was a victim of a Satanic ceremony at age three and had been forced to drink human blood. But this was not what was hindering her deliverance.\n\nShe believed that because she was part of such a Satanic ritual, there was no hope for her. That was the lie and deception, because there is always hope in Christ. No matter how radical the Satanic involvement or encounter or how terrible the past sins that were committed, there is always hope. What the enemy wants to do is tell you there is no hope for you. If you believe you cannot be delivered, you cannot be delivered.\n\nThrough many experiences, I have learned that when performing deliverance on a homosexual person, the first demon that needs to be cast out is not homosexuality. It is the demon of lies and deception. This is because many believe they are born that way and that God created them that way. You need to remove the demon of lies and deception to expel the demons of perversion.\n\nDisbelief\n\nNo one can exercise deliverance against a person’s will. I had a woman come to the altar at one of my meetings and order me: “Do your thing. I guess I need deliverance.” I simply walked away. Her disbelief was obvious in her grudging attitude. Again, if you believe you cannot be delivered, you cannot be delivered.\n\nDoubt\n\nAnother woman came to the altar and asked for a prayer for deliverance. I asked if she believed she could be delivered. She said, “Maybe.” She had no faith that Jesus could deliver her, but she did have the will to seek deliverance. First, we prayed for faith and read a few Scriptures. Then I asked if she believed she could get delivered. This time, she had no hesitation that she could, and she was set free in moments.\n\nDenial\n\nDenial of the need for deliverance is also a hindrance. There have been some people who came asking for prayer who were very superficial and casual in their approach. They were not aware of the seriousness of their captivity.\n\nOne young girl who had had many abortions was unable to confess them as murder. She couldn’t get delivered until she completely broke down under the conviction of the Holy Spirit and confessed and repented from murder. I am not being judgmental here. Before accepting the Lord Jesus as my Lord and Savior, I had two abortions. I carried guilt and shame even during my Christian walk until one day I had to call it as it is, murder, and repent. I immediately received forgiveness and was set free from guilt and shame.\n\nAnother lady who was addicted to masturbation could not confess her sin of masturbation. She could not accept it as a sin. I told her there was nothing I could do for her freedom. Without repentance, there is just no way that demon is going to leave.\n\nIf you want to stay dignified and your pride means more to you than your freedom, you can’t be delivered. Humbling yourself before the Lord brings so much redemption, while holding on to your pride empowers Satan and his demons.\n\nDoublemindedness\n\nDoublemindedness is another serious hindrance that can prevent a person’s freedom.\n\nYou must settle these questions between you and the Lord:\n\nCan Jesus deliver me?\n\nIs it God’s will for me to be free?\n\nDoes God want me to be free?\n\nCan I be truly set free after all my sins, abuse, demonic encounters, and even if I sold my soul to the devil? Is deliverance possible for me?\n\nIs this that easy?\n\nIs this happening or we are just going along with this ritual?\n\nIs my deliverance taking place?\n\nIs this deliverance for me?\n\nWhat if the enemy hurts me?\n\nWhat if the devil throws me to the floor and foam comes from my mouth and everyone will see me like that?\n\nWill it be embarrassing that I will look like a mess?\n\nWhat if I don’t have enough faith for this deliverance?\n\nI have so many sins in my life, I am not worthy of this. Can this backfire on me?\n\nYou need to know that Jesus died on the cross to settle all the above questions and doubts for you! It is finished! Jesus made it easy. He made a way!\n\nPrayer Against Hindering Spirits\n\nDear Lord Jesus,\n\nI put myself under Your authority. I declare that You are my Lord and Savior and You have given me authority to expel demons. You died on the cross to set me free from my sins, curses, chains, and sicknesses. Based on the authority You have given me, I bind all hindering spirits and command doubt, disbelief, lies, and deceptions to leave me in Jesus’ Name. I bind the voice of the enemy and his lies in Jesus Christ’s Name. I invite the Holy Spirit, Spirit of Truth, and His freeing power into my life in Jesus’ Name. Amen!\n\n7. Forgive\n\nForgiveness is a crucial part of your deliverance. If you are holding any grudges or have bitterness and resentment in your heart toward anyone, you cannot be free. Unforgiveness opens a door to the demonic. I suggest you go before the Lord and ask the Holy Spirit to reveal to you if there is anyone in your life or in your past who has hurt you and whom you haven’t forgiven. If God shows you that, you can then ask Him to give you the ability to forgive.\n\nPowerful Tips\n\nSome deliverance is a process and takes place with counseling and the agape love of God.\n\nSometimes we almost try to convince ourselves, others, and even God with long and religious prayers. Faith is activated when we command the devil to flee, sickness to leave, or peace and joy to come in.\n\nJesus said, “Pick up your mat and walk.” He didn’t pray for the sick but commanded sickness to leave. Now He is telling us, “Follow Me.”\n\nBe free in Jesus’ Name!\n\nBe filled with joy in Jesus’ Name!\n\nBe healed in Jesus’ Name!\n\nBe delivered in Jesus’ Name!\n\nStart activating your faith by your words and exercising authority over your situation.\n\nIsik Abla"}