{"title": "Approaches for Deliverance - Gerry Breshears", "text": "Dr. Gerry Breshears\n\nSpiritual Warfare\n\nth251-17\n\nApproaches for Deliverance\n\nLesson Transcript\n\nSo what I would do from this section of the course is talk more about the practical, how-to's. We began with looking at biblical worldview and ancient eastern worldview and modern worldviews, and given my perspective on that. Then biblical theology, the truth through scripture unpacked a number of things there. But this I want to come back to how do you do it? How do you approach deliverance from people being dominated by demons, attached to demons, and attacked by demons, those sorts of things. And I want to think particularly here in terms of the so-called deliverance ministry and related to that, and talk to you about how I do some of these kinds of things. But to begin with this, what I want to do is two things; I want to give you think through a basic bibliography that I find helpful and then I want to look at three approaches to deliverance ministry.\n\nSo I think of the bibliography. My first recommendation is John Mark comer's \"Live No Lies\". John Mark was Pastor in Bridgetown. He's with Practicing Away now and this is ordinary spiritual warfare; the world, the flesh, and the devil and how I respond to those. There's no deliverance in there, no kicking demons out or anything like that. Though he believes in those things. This book is about just everyday life in the world that's opposed to Jesus by its marketing, the deceptions that come in so different ways. A second book, Sam Storms \"Understanding Spiritual Warfare, A comprehensive Guide\". Sam is the Pastor at Bridgeway Church back in Oklahoma City area. Been doing this sort of stuff a long time. He's a PhD in New Testament. He was on the Wheaton doctoral faculty and now pastor. So he brings both the academic and the pastoral side in very powerful ways.\n\nAnother book from another New Testament, top New Testament scholar, Clint Arnold, \"Three Crucial Questions about Spiritual Warfare\". Clint has also been doing deliverance ministry for a long time. Also, powerful academic. He has been dean at Talbot Seminary. He's stepped out of that and now doing New Testament work toward the end of his career there, but just really well done. But it brings both the biblical and practical side of things. Michael Heiser, \"The Unseen Realm\". This is Mike's fat book that kind of gives you the whole biblical worldview from the, he's called the Divine Council Worldview that the gods as a category of spiritual beings and really digging deeply into a lot of biblical passages. And then his Naked Bible podcast is a biblical exposure. He's got a number of books and I think unseen realm is really helpful. There are a few places where I differ with these ones up to this point, but nothing significant.\n\nAnd then finally it's a Four Views book; \"Understanding Spiritual Warfare\" and this is much broader. So you've got Walter Wink, you've got David Powlison, Greg Boyd, and Pete Wagner, and Rebecca Greenwood and what they're doing, and this is significant difference, it seems to me, Walter Wink is coming the idea that there aren't any... Spiritual power is not there. These powers are world governments and kings, not supernatural powers. And that's had a lot of impact. The classical model, he called it David Powlison, he's a pastor counselor who does deliverance ministry. But in the classical model, I'll talk to you a little bit. Greg Boyd is the ground level deliverance model. That's a unique kind of thing. Greg does everything uniquely. And then Pete Wagner, his treaty level deliverance model. This is the idea. We need to pray down the Prince of Portland before we do evangelism in Portland.\n\nSo this is a broader view or broader list than where I'm going to go, but there are other books in there as well. So I also have here my website creatively brochures.net, and there's a spiritual warfare resources. I've got a lot of stuff there. So you can visit that at any time you like. So what I want to do is a handout that I've put together, three models of deliverance. And you can download it if you haven't already from the lesson page. And in these three models, these are evangelical. So the Four Views book is broader. Walter Wink is not an evangelical, the other three are. So the first one I just call conversion encounter or the classic model, that's David Powlison's view. And the key there is either person has a demon and isn't a Christian or he, she is a Christian but only thinks they have a demon.\n\nAnd the key point here, the key point here, the argument is Holy Spirit in a demonic spirit cannot occupy the same space or person. That's the foundational commitment. We are temple of the Holy Spirit. And because we are temple of the Holy Spirit, a demonic spirit cannot be inside the body of a person. And the argument is the Old Testament temple is the temple of the Holy Spirit. We are temple of the Holy Spirit. So when Spirit comes in, if they're demonic stuff, they have to go out. So the deliverance ministry with Christians, which is so popular in so many different areas, they're going to say that's completely bogus. Nowhere in the epistles do you see any commander instruction to cast demons out of a believer. In fact, they don't do any demon casting at all. Just preach and apply the gospel and resist all satanic temptation by standing firm in the Word.\n\nAnd so John MacArthur, David Powlison, and Hank Hanegraaf would be among many who hold this view. In a key passage they have here is second Corinthians six and in two Corinthians six it says very clearly, and without any questions, second Corinthians six, it says, you're the temple of the Holy Spirit, you're the temple of living God. Six 16 we are temple of living God and therefore the argument is that what agreement between the temple of God and idols. We are the temple of living God. And the argument is therefore the demonic spirit can't be in it. Now, I'll just say here because I don't agree with this view, at least the foundation of it, is this passage does not say that a demon cannot be inside a believer. It does not say that. It does say we're temple of the Holy Spirit. The command is do not be yoked together with unbelievers.\n\nSo it's saying how can say business partners or marriage partners be yoked together if one's a believer and one's an unbeliever? What does the righteous or wicked have in common? What fellowship is light with darkness, or harmony between Christ and Belial, between a believer and unbeliever? What agreement between temple of God and idols? He says, we're serving different masters with different agendas. How can you relate partner together? I don't think he says it can't be done, he's saying it shouldn't be done. If I look in second Kings 21, this is Manasseh and he's a really bad guy. And what it says here in two Kings 21:4, he built altars in the temple of the Lord of which the Lord had said, in Jerusalem I've put my name. In the two courts of the temple of the Lord, he built altars to all the starry hosts. Verse seven, he took carved Asherah poles he had made and put it in the temple, which the Lord had said to David and his son Solomon, this temple in Jerusalem I've chosen. I'll put my name forever.\n\nAnd it goes on to talk about there. So here's Manasseh, a very bad guy, putting demonic stuff in the temple and God is still in the Holy of Holies. If I come to second Kings, 23 verse four. Now this is Josiah, his son saying this is not good. Second second Kings 23:4, \"The king ordered Hilkiah the high priest and the priest next in rank, and door keepers to remove from the temple of Lord all the articles made for Baal and Asherah, and all the starry hosts. He burned them outside Jerusalem in the fields in the Kidron Valley, took their ashes to Bethel. Did away with the adulterous priests appointed by the kings of Judah to burn incenses and all that.\" So what it's saying here, verse six, he took the Asherah pole from the temple to the Kidron valley outside Jerusalem, burned it there. So very clearly, Manasseh is putting demonic stuff in the temple and Josiah is taking it out of the temple.\n\nAnd if you look in Ezekiel, when God takes Ezekiel back to show him why you're in Babylon, Ezekiel eight through 11, he shows him all the stuff that's going on in the temple with worship of other gods in the temple. And he goes through the temple and the priests and people are doing all kinds of things. And that's where you get the Ichabod. God now departs the temple, because of the persistence of the worship of demons in the temple. And they go to Babylon and God goes to Babylon with them, but the whole point of this in the Old Testament, you do have demonic stuff in the temple at the same time God is in the Holy of Holies. So my take on that is that in the Old Testament you can have demonic stuff in the temple. I don't know whether that's an exact analogy to the believer today or not.\n\nSo my take is, I don't know whether a demon can be inside a believer or not, I just don't know. So I'll talk more about how to deal with that. But my thing is, I don't think the physical location of a spiritual being is a key issue. I think the authority and influence of a spiritual being is the key issue. So from my perspective, whether the demons inside the body or outside the body is a secondary issue. The thing is what authority and influence it has. The place where I really disagree with the classic model is the way it's often applied and the application is, well, we're temple of Holy Spirit, we don't need to worry about the demons. Let's just do bible study and that kind of stuff. And the scripture's really clear that we are in a war with Satan. Ephesians 6:13 could not be more clear that that's going on. First Peter five and such.\n\nAnd that's where I really disagree with this is they come to the conclusion that it's not a problem we have to deal with. And you can have the classic model and leave demons a real problem, but they can't be inside us. So that's the first model. The second model here is what's commonly called power encounter. And that's the idea Christians can be demonized and controlled but not possessed or completely controlled. And the key factor is unconfessed sin gives a demon a right or ground to invade and indwell a believer. So Ephesians four, if I have hanged onto anger, unconfessed sin gives legal right for the demon to enter and stay.\n\nAnd here's the key point, a demon can't be removed until the sin gives a ground of occupation is canceled. So if we have sin in life, unconfessed sin, if I refuse to confess, if I hang on to it, I give a demon legal right to enter and stand, and stay and I can't get rid the demon until I get rid of the sin. And that's where you do the, what I call interview the demons technique, because the believer often doesn't know the ground the demon is standing on. So you command the demon to manifest itself, you bind it in the name of Jesus, you get a whole bunch of information, name, ground, place of attachment, courts, et cetera. Then you have the believer cancel the ground by confessing the sin and covering with the blood of Jesus. And you then specifically cancel that ground by verbal proclamation. Then and only then can you cast the demon out.\n\nAnd I've got a number of names that use variations on this and I think that's completely wrong. I don't think a demon ever has legal ground that we have to get rid of. And going back to the biblical theology, I don't see Jesus ever ask for name and ground and all those kinds of things. Nothing like that anywhere in scripture. Now if you look in the ancient world, then there's a lot of that kind of stuff going on, but I just don't think that's our method. And again, I'll unpack this further as we talk about it, but I really think this is a mistake and understanding that says we have to cancel ground, the foothold there is opportunity or something the devil will take advantage of. And I really agree with that. The devil will take advantage of anything just like he did with Peter in confrontation with Jesus in Matthew 16.\n\nThe third model commonly called truth encounter, which is a title I really don't like. It's not like we've got the truth and nobody else does, like come on, is that ultimately arrogant or what? This is a point of disagreement of good and godly people, but that's the name that's been associated with it. And the thing here is the heart of this is demons have no authority over a believer. We have no authority over a believer. We've been transferred from darkness to light and it has no authority. However, Christians can fall prey to deception and yield control to a demon. If I believe it's lies, I can give it authority in my life consciously or unconsciously. And I obey it because I think it has authority. And that's the problem, is people believe that that's the best way to do things or they believe they have to do it because they made an agreement back in something in their prior days. And so that's where the problem comes in my understanding. So the idea of truth encounter is to cancel the lies that the demons are appealing to get us to follow their ways.\n\nAnd so that's where it comes is cancel the lies. So the basic idea here is not to talk to the demon. In fact, I don't talk to demons at all except to rebuke them and tell them to get out, get away. I talk with the person, not the demon, and I help the person, the Christian, personalize the truth of their identity in Christ. I'm not in darkness, I am light. You are light in the Lord, and then overcome the deceptions they fallen prey to and then follow Jesus' example to speak scripture out loud to the devil, command the devil to get away in Jesus' name and then come back to Jesus stuff. And that's the approach that I use. So I've got several people be in this thing, Clint Arnold, Neil Anderson, John Eldredge.\n\nI think this is a better way to do things. And so I want to unpack that, the how to, recognizing that people from different models will do different ways of doing things. And I'm not going to go through other ways of doing it at this point, but I will talk about how I do it. And then encourage you if you're working with somebody, get ahold of Carl Payne's book on spiritual warfare. Theology wise, Carl and I are on the same spot, but I think his interview the demons technique and test their lies, test their statements for lies. I just can't find that in scripture. And I really disagree with my friend on the methodology. We've done stuff together, we've known each other for 30 plus years and I respect Carl highly. Pastor at Antioch Church up in Bellevue, but I just think he's wrong and we talk about it and then go have coffee together and talk about ministry. We are great friends. Same way in the classic model. I strongly advise, get ahold of John MacArthur's book. I've forgotten the name of it.\n\nIt's a book that really unpacks his model well and the reasons behind it. Get ahold of David Powlison's material. In their arguing their view well. And my thing is examine firsthand, think carefully. Is this the biblical way to do things and in comparing the different views, which view accounts for the most biblical data with the fewest difficulties is my thing. I think that the so-called truth encounter is the best way to do things and I think that's the most effective way to do deliverance ministry and releasing people from the lies and entrapment of the devil. So that's what I suggest. So we'll unpack the how-to's at some length to give you how I do it, recognizing there other people do it different ways. The thing is to find out what works for you that's within the biblical guidelines and helping people find freedom from the lies and entrapment of Satan. That's the goal.\n\nThis may be getting ahead of you, so you may be going to cover it, but I keep going back to Jesus saying, \"Satan, get behind me.\" There has to be a point, at least to some degree and in some way that Satan can get inside a Christian. At least he made Peter say something. That's not possession or even oppression, but wouldn't you agree that as you look at these different models, you have to allow for the fact that Satan can get in our head? Is that a fair thing?\n\nYes, it's, and the classic model, even a John MacArthur who's adamant to a believer cannot have a demon inside them, will Satan contempt and get us to believe lies? He'll agree to that, but he would never cast a demon out or tell it to get away. He'll say, go strengthen yourself in the Holy Spirit. His methodology is different, but he really believes we can believe the lives of Satan that comes through the world, the flesh, and the devil.\n\nBut Peter actually said the words of Satan.\n\nI don't agree with MacArthur and that's part of the reason I would agree. When I look at scripture, I think Satan can do more than what the classic model allows him to do. And I also see we're commanded to verbally oppose Satan, which I think means command him to get away. If not get out, at least get away. And somebody from a classic model could still do the get away from me even if they didn't think it's right to say, get out of me. And that's where in the classic model, there are some who do deliverance of a sort, but they would really disagree that Satan can enter into, in a significant way the life and actions of a believer."}