{"title": "What is deliverance ministry, and is it biblical?", "text": "Question\n\nAnswer\n\nThe generally agreed-upon definition of “deliverance ministry” will usually focus on the casting out of demons or spirits in an attempt to solve problems related to specific demons. For example, a deliverance minister may seek to help someone overcome anger by casting out a spirit of anger. Deliverance ministries also focus on tearing down spiritual strongholds in one’s life, finding inner healing, and claiming the victory in Christ over all enemies. Many refer to soul ties , curses, and the “legal rights” of demons. Biblically, demons or evil spirits are known to be fallen angels that rebelled in heaven with Satan (Revelation 12:4, 9; Isaiah 14:12–20; Ezekiel 28:1–19).There is certainly quite a bit in Scripture about Satan and his horde of demons. There is little said about deliverance from them, and nothing said about deliverance as a “ministry.” The offices of the church are found in Ephesians 4:11. First were the apostles and prophets, the foundation of the church—with Jesus being the Chief Cornerstone (Ephesians 2:20). Next are listed evangelists, then pastors, and teachers. The ability to cast out demons is not listed as a spiritual gift or a ministerial duty.The Gospels and Acts relate that Jesus and the disciples cast out demons. The teaching portions of the New Testament (Romans through Jude) refer to demonic activity yet do not discuss the method of casting them out, nor are believers exhorted to do so. We are told to put on the whole armor of God to stand against spiritual wickedness (Ephesians 6:10–18). We are told to resist the devil (James 4:7) and not give him room in our lives (Ephesians 4:27). However, we are not told how to cast him or his demons out of others, or that we should even consider doing so.It is interesting that we have no record of Jesus’ instructions to His disciples on how to cast out demons, with the possible exceptions of Matthew 12:43–45 and 17:19–21, where some insight is given. When the disciples discovered that demons were subject to them in the name and authority of Jesus, they were joyful (Luke 10:17; cf. Acts 5:16; 8:7; 16:18; 19:12). But Jesus told the disciples, “Do not rejoice in this, that the spirits are subject to you, but rejoice that your names are recorded in heaven” (Luke 10:20).Rather than being given a specific “deliverance ministry,” we have an authority in the powerful name of Jesus. One day, John said to Jesus, “We saw someone driving out demons in your name and we told him to stop, because he was not one of us.’ ‘Do not stop him,’ Jesus said. ‘For no one who does a miracle in my name can in the next moment say anything bad about me, for whoever is not against us is for us’” (Mark 9:38–40). Authority over demons is clearly the power of the Lord at work, whether or not the exorcist has a special ministry of deliverance.The emphasis in spiritual warfare is highlighted in verses such as 1 John 4:4, “You, dear children, are from God and have overcome them, because the one who is in you is greater than the one who is in the world [the devil].” The victory is ours because of the Holy Spirit who dwells within us. Believers can overcome their struggles with the past, habits, and addictions, because “everyone born of God overcomes the world” (1 John 5:4). We need prayer, godly counsel, and the support of a good church, but not necessarily a “deliverance minister.”We are told to “be alert and of sober mind. Your enemy the devil prowls around like a roaring lion looking for someone to devour. Resist him, standing firm in the faith. . . . And the God of all grace, who called you to his eternal glory in Christ, after you have suffered a little while, will himself restore you and make you strong, firm and steadfast” (1 Peter 5:8–10).The key to victory in the Christian life is to be filled (controlled and empowered) with the Holy Spirit on a moment-by-moment basis (Ephesians 5:18). The Father knows who are His: “Those who are led by the Spirit of God are the children of God” (Romans 8:14). The Holy Spirit will not indwell anyone who is not born again (John 3:3–8; 2 Timothy 2:19; Acts 1:8; 1 Corinthians 3:16), so the first step in spiritual victory is to place our faith in Jesus Christ. Then, rejoice that Jesus is in you and you have His power and His victory."}